import React, { FC } from 'react';
// @ts-ignore
import { StackedBar } from '@pansy/react-charts';

const Example: FC = () => {
  const data = [
    {
      地区: '华东',
      细分: '公司',
      销售额: 1454715.807999998
    },
    {
      地区: '华东',
      细分: '消费者',
      销售额: 2287358.261999998
    },
    {
      地区: '华东',
      细分: '小型企业',
      销售额: 942432.3720000006
    },
    {
      地区: '中南',
      细分: '公司',
      销售额: 1335665.3239999984
    },
    {
      地区: '中南',
      细分: '消费者',
      销售额: 2057936.7620000008
    },
    {
      地区: '中南',
      细分: '小型企业',
      销售额: 743813.0069999992
    },
    {
      地区: '东北',
      细分: '公司',
      销售额: 834842.827
    },
    {
      地区: '东北',
      细分: '消费者',
      销售额: 1323985.6069999991
    },
    {
      地区: '东北',
      细分: '小型企业',
      销售额: 522739.0349999995
    },
    {
      地区: '华北',
      细分: '公司',
      销售额: 804769.4689999995
    },
    {
      地区: '华北',
      细分: '消费者',
      销售额: 1220430.5610000012
    },
    {
      地区: '华北',
      细分: '小型企业',
      销售额: 422100.9870000001
    },
    {
      地区: '西南',
      细分: '公司',
      销售额: 469341.684
    },
    {
      地区: '西南',
      细分: '消费者',
      销售额: 677302.8919999995
    },
    {
      地区: '西南',
      细分: '小型企业',
      销售额: 156479.9319999999
    },
    {
      地区: '西北',
      细分: '公司',
      销售额: 253458.1840000001
    },
    {
      地区: '西北',
      细分: '消费者',
      销售额: 458058.1039999998
    },
    {
      地区: '西北',
      细分: '小型企业',
      销售额: 103523.308
    }
  ];
  const config = {
    data,
    yField: '地区',
    xField: '销售额',
    stackField: '细分',
    label: {
      offset: 0,
      visible: true,
      position: 'middle',
      formatter: (v: number) => Math.round(v / 10000) + '万'
    }
  };
  return <StackedBar {...config} />;
};

export default Example;
